ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_sd_host.c
/*******************************************************************************
* Function Name: Cy_SD_Host_eMMC_InitCard
****************************************************************************//**
*
*  Initializes the eMMC card.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *config
*     The pointer to the SD card configuration structure.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_eMMC_InitCard(SDHC_Type *base,
                                                       cy_stc_sd_host_sd_card_config_t const *config,
                                                       cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_SUCCESS;
    cy_en_sd_host_bus_speed_mode_t speedMode = CY_SD_HOST_BUS_SPEED_EMMC_LEGACY;
    uint32_t retry;
    uint32_t ocrReg; /* The Operation Condition register. */
    uint32_t cidReg[CY_SD_HOST_CID_SIZE];  /* The Device Identification register. */
    uint32_t extCsd[CY_SD_HOST_EXTCSD_SIZE] = { 0UL };
    uint32_t genericCmd6Time;
    uint32_t csdReg[CY_SD_HOST_CSD_SIZE]; /* The Card-Specific Data register. */

    /* Reset Card (CMD0). */
    ret = Cy_SD_Host_OpsGoIdle(base); /* The Idle state. */
    
    /* Software reset for the CMD line */
    Cy_SD_Host_SoftwareReset(base, CY_SD_HOST_RESET_DATALINE);
    Cy_SD_Host_SoftwareReset(base, CY_SD_HOST_RESET_CMD_LINE);

    retry = CY_SD_HOST_RETRY_TIME;
    while (retry > 0UL)
    {
        /* Get OCR (CMD1). */
        ret = Cy_SD_Host_MmcOpsSendOpCond(base,
                                          &ocrReg,
                                          CY_SD_HOST_EMMC_VOLTAGE_WINDOW,
                                          context);

        context->cardCapacity = CY_SD_HOST_EMMC_LESS_2G;

        /* Check if the eMMC capacity is greater than 2GB */
        if (CY_SD_HOST_OCR_CAPACITY_MASK == (ocrReg & CY_SD_HOST_OCR_CAPACITY_MASK))
        {
            context->cardCapacity = CY_SD_HOST_EMMC_GREATER_2G;
        }

        if (CY_SD_HOST_SUCCESS == ret)
        {
            break;
        }
        else
        {
            Cy_SD_Host_ErrorReset(base);

            Cy_SysLib_DelayUs(CY_SD_HOST_CMD1_TIMEOUT_MS); /* The CMD1 timeout. */
        }
        retry--;
    }

    /* The low voltage operation check. */
    if ((true == config->lowVoltageSignaling) &&
        (CY_SD_HOST_EMMC_DUAL_VOLTAGE == (ocrReg & CY_SD_HOST_EMMC_DUAL_VOLTAGE)))
    {
        /* Power down the MMC bus */
        Cy_SD_Host_DisableCardVoltage(base);
        
        Cy_SysLib_Delay(CY_SD_HOST_1_8_REG_STABLE_TIME_MS);
        
        /* Switch the bus to 1.8 V */
        Cy_SD_Host_ChangeIoVoltage(base, CY_SD_HOST_IO_VOLT_1_8V);

        Cy_SD_Host_EnableCardVoltage(base);
        (void)Cy_SD_Host_SdCardChangeClock(base, CY_SD_HOST_CLK_400K);

        /* Wait 10 ms */
        Cy_SysLib_Delay(CY_SD_HOST_1_8_REG_STABLE_TIME_MS);

        retry = CY_SD_HOST_RETRY_TIME;
        while (retry > 0UL)
        {
            /* Get OCR (CMD1). */
            ret = Cy_SD_Host_MmcOpsSendOpCond(base,
                                              &ocrReg,
                                              CY_SD_HOST_EMMC_VOLTAGE_WINDOW,
                                              context);

            Cy_SD_Host_ErrorReset(base);

            if (CY_SD_HOST_SUCCESS == ret)
            {
                break;
            }

            Cy_SysLib_DelayUs(CY_SD_HOST_CMD1_TIMEOUT_MS); /* The CMD1 timeout. */
            retry--;
        }
    }

    if (CY_SD_HOST_SUCCESS == ret) /* The ready state. */
    {
        /* Get CID (CMD2). */
        ret = Cy_SD_Host_GetCid(base, cidReg);
        
        Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

        if (CY_SD_HOST_SUCCESS == ret) /* The Identification state. */
        {
            /* Get RCA (CMD3) */
            context->RCA = Cy_SD_Host_GetRca(base);

            /* The stand-by state. */

            /* Get CSD (CMD9)  */
            ret = Cy_SD_Host_GetCsd(base, csdReg, context);
            
            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Select the card (CMD7). */
                ret = Cy_SD_Host_OpsSelectCard(base, context);

                if (CY_SD_HOST_SUCCESS == ret) /* The transfer state. */
                {
                    /* Get Ext CSD (CMD8).
                    * Capacity Type and Max Sector Num are in the context.
                    */
                    ret = Cy_SD_Host_GetExtCsd(base, extCsd, context);

                    /* Get GENERIC_CMD6_TIME [248] of the EXTCSD register */
                    genericCmd6Time = CY_SD_HOST_EMMC_CMD6_TIMEOUT_MULT * 
                                      (extCsd[CY_SD_HOST_EXTCSD_GENERIC_CMD6_TIME] & 
                                       CY_SD_HOST_EXTCSD_GENERIC_CMD6_TIME_MSK);

                    if ((CY_SD_HOST_SUCCESS == ret) &&
                        (CY_SD_HOST_BUS_WIDTH_1_BIT != config->busWidth))
                    {
                            /* Set Bus Width (CMD6) */
                            ret = Cy_SD_Host_SetBusWidth(base,
                                                         config->busWidth,
                                                         context);

                            Cy_SysLib_Delay(genericCmd6Time); /* The CMD6 timeout. */
                    }

                    if (CY_SD_HOST_SUCCESS == ret)
                    {
                        /* Set Bus Speed Mode (CMD6). */
                        ret = Cy_SD_Host_SetBusSpeedMode(base,
                                                         speedMode,
                                                         context);
                        if (CY_SD_HOST_SUCCESS == ret)
                        {
                            (void)Cy_SD_Host_SdCardChangeClock(base, CY_SD_HOST_CLK_25M);
                        }
                        Cy_SysLib_Delay(CY_SD_HOST_CLK_RAMP_UP_TIME_MS);
                    }
                }
            }
        }
    }

    return ret;
}


