ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_sd_host.c
            *config->rca = context->RCA;
            *config->cardType = context->cardType;
            *config->cardCapacity = context->cardCapacity;
        }
        else
        {
            /* The SD card is disconnected or an embedded card. */
            ret = CY_SD_HOST_ERROR_DISCONNECTED;
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_Read
****************************************************************************//**
*
*  Reads single- or multiple-block data from the SD card / eMMC. If DMA is not used
*  this function blocks until all data is read.
*  If DMA is used all data is read when the Transfer complete event is set. 
*  It is the user responsibility to check and reset the transfer complete event 
*  (using \ref Cy_SD_Host_GetNormalInterruptStatus and 
*  \ref Cy_SD_Host_ClearNormalInterruptStatus functions). 
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *config
*     The pointer to the SD card read-write structure.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_Read(SDHC_Type *base,
                                       cy_stc_sd_host_write_read_config_t *config,
                                       cy_stc_sd_host_context_t const *context)
{
    cy_en_sd_host_status_t       ret  = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    cy_stc_sd_host_cmd_config_t  cmd;
    cy_stc_sd_host_data_config_t dataConfig;
    uint32_t                     dataAddress = config->address;
    uint32_t aDmaDescriptTbl[CY_SD_HOST_ADMA2_DESCR_SIZE]; /* The ADMA2 descriptor table. */
    uint32_t length; /* The length of data to transfer for a descriptor. */

    if ((NULL != context) && (NULL != config) && (NULL != config->data))
    {
        CY_ASSERT_L3(CY_SD_HOST_IS_AUTO_CMD_VALID(config->autoCommand));
        CY_ASSERT_L2(CY_SD_HOST_IS_TIMEOUT_VALID(config->dataTimeout));
        CY_ASSERT_L3(CY_SD_HOST_IS_DMA_WR_RD_VALID(context->dmaType));
        
        /* 0 < maxSectorNum check is needed for legacy cards. */
        if (!((0UL < context->maxSectorNum) &&
             ((context->maxSectorNum - dataAddress) < config->numberOfBlocks)))
        {
            if (CY_SD_HOST_SDSC == context->cardCapacity)
            {
                dataAddress = dataAddress << CY_SD_HOST_SDSC_ADDR_SHIFT;
            }

            if (1UL < config->numberOfBlocks)
            {
                cmd.commandIndex = CY_SD_HOST_SD_CMD18;
                dataConfig.enableIntAtBlockGap = true;
            }
            else
            {
                cmd.commandIndex = CY_SD_HOST_SD_CMD17;
                dataConfig.enableIntAtBlockGap = false;
            }

            dataConfig.blockSize = CY_SD_HOST_BLOCK_SIZE;
            dataConfig.numberOfBlock = config->numberOfBlocks;
            dataConfig.enableDma = config->enableDma;
            dataConfig.autoCommand = config->autoCommand;
            dataConfig.read = true;
            dataConfig.dataTimeout = config->dataTimeout;
            dataConfig.enReliableWrite = config->enReliableWrite;

            if ((true == dataConfig.enableDma) && 
                (CY_SD_HOST_DMA_ADMA2 == context->dmaType))
            {
                length = CY_SD_HOST_BLOCK_SIZE * config->numberOfBlocks;

                aDmaDescriptTbl[0] = (1UL << CY_SD_HOST_ADMA_ATTR_VALID_POS) | /* Attr Valid */
                                     (1UL << CY_SD_HOST_ADMA_ATTR_END_POS) |   /* Attr End */
                                     (0UL << CY_SD_HOST_ADMA_ATTR_INT_POS) |   /* Attr Int */
                                     (CY_SD_HOST_ADMA_TRAN << CY_SD_HOST_ADMA_ACT_POS) |
                                     (length << CY_SD_HOST_ADMA_LEN_POS);     /* Len */

                aDmaDescriptTbl[1] = (uint32_t)config->data;

                /* The address of the ADMA2 descriptor table. */
                dataConfig.data = (uint32_t*)&aDmaDescriptTbl[0];
            }
            else
            {
                /* SDMA mode. */
                dataConfig.data = (uint32_t*)config->data;
            }

            ret = Cy_SD_Host_InitDataTransfer(base, &dataConfig);

            if (CY_SD_HOST_SUCCESS == ret)
            {
                cmd.commandArgument = dataAddress;
                cmd.dataPresent     = true;
                cmd.enableAutoResponseErrorCheck = false;
                cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
                cmd.enableCrcCheck  = true;
                cmd.enableIdxCheck  = true;
                cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

                ret = Cy_SD_Host_SendCommand(base, &cmd);
                    
                if (CY_SD_HOST_SUCCESS == ret)
                {
                    /* Wait for the Command Complete event. */
                    ret = Cy_SD_Host_PollCmdComplete(base);
                }
                
                if ((CY_SD_HOST_SUCCESS == ret) &&
                    (false == dataConfig.enableDma))
                {
                    /* DMA is not used - wait until all data is read. */
                    ret = Cy_SD_Host_CmdRxData(base, &dataConfig);
                }
            }
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_Write
****************************************************************************//**
*
*  Writes single- or multiple-block data to the SD card / eMMC. If DMA is not 
*  used this function blocks until all data is written.
*  If DMA is used all data is written when the Transfer complete event is set. 
*  It is the user responsibility to check and reset the transfer complete event 
*  (using \ref Cy_SD_Host_GetNormalInterruptStatus and 
*  \ref Cy_SD_Host_ClearNormalInterruptStatus functions).
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *config
*     The pointer to the SD card read-write structure.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_Write(SDHC_Type *base,
                                        cy_stc_sd_host_write_read_config_t *config,
                                        cy_stc_sd_host_context_t const *context)
{
    cy_en_sd_host_status_t       ret  = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    cy_stc_sd_host_cmd_config_t  cmd;
    cy_stc_sd_host_data_config_t dataConfig;
    uint32_t                     dataAddress = config->address;
    uint32_t aDmaDescriptTbl[CY_SD_HOST_ADMA2_DESCR_SIZE]; /* The ADMA2 descriptor table. */
    uint32_t length;  /* The length of data to transfer for a descriptor. */

    if ((NULL != context) && (NULL != config) && (NULL != config->data))
    {
        CY_ASSERT_L3(CY_SD_HOST_IS_AUTO_CMD_VALID(config->autoCommand));
        CY_ASSERT_L2(CY_SD_HOST_IS_TIMEOUT_VALID(config->dataTimeout));
        CY_ASSERT_L3(CY_SD_HOST_IS_DMA_WR_RD_VALID(context->dmaType));

        /* 0 < maxSectorNum check is needed for legacy cards */
        if (!((0UL < context->maxSectorNum) &&
             ((context->maxSectorNum - dataAddress) < config->numberOfBlocks)))
        {
            if (CY_SD_HOST_SDSC == context->cardCapacity)
            {
                /* The SDSC card uses a byte-unit address, multiply by 512 */
                dataAddress = dataAddress << CY_SD_HOST_SDSC_ADDR_SHIFT;
            }

