ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_sd_host.c
            if (1UL < config->numberOfBlocks)
            {
                cmd.commandIndex = CY_SD_HOST_SD_CMD25;
                dataConfig.enableIntAtBlockGap = true;
            }
            else
            {
                cmd.commandIndex = CY_SD_HOST_SD_CMD24;
                dataConfig.enableIntAtBlockGap = false;
            }
            
            dataConfig.blockSize = CY_SD_HOST_BLOCK_SIZE;
            dataConfig.numberOfBlock = config->numberOfBlocks;
            dataConfig.enableDma = config->enableDma;
            dataConfig.autoCommand = config->autoCommand;
            dataConfig.read = false;
            dataConfig.data = (uint32_t*)config->data;
            dataConfig.dataTimeout = config->dataTimeout;
            dataConfig.enReliableWrite = config->enReliableWrite;

            if ((true == dataConfig.enableDma) && 
                (CY_SD_HOST_DMA_ADMA2 == context->dmaType))
            {
                length = CY_SD_HOST_BLOCK_SIZE * config->numberOfBlocks;

                aDmaDescriptTbl[0] = (1UL << CY_SD_HOST_ADMA_ATTR_VALID_POS) | /* Attr Valid */
                                     (1UL << CY_SD_HOST_ADMA_ATTR_END_POS) |   /* Attr End */
                                     (0UL << CY_SD_HOST_ADMA_ATTR_INT_POS) |   /* Attr Int */
                                     (CY_SD_HOST_ADMA_TRAN << CY_SD_HOST_ADMA_ACT_POS) |
                                     (length << CY_SD_HOST_ADMA_LEN_POS);     /* Len */

                aDmaDescriptTbl[1] = (uint32_t)config->data;

                /* The address of the ADMA descriptor table. */
                dataConfig.data = (uint32_t*)&aDmaDescriptTbl[0];
            }
            else
            {
                dataConfig.data = (uint32_t*)config->data;
            }

            ret = Cy_SD_Host_InitDataTransfer(base, &dataConfig);

            if (CY_SD_HOST_SUCCESS == ret)
            {
                cmd.commandArgument = dataAddress;
                cmd.dataPresent     = true;
                cmd.enableAutoResponseErrorCheck = false;
                cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
                cmd.enableCrcCheck  = true;
                cmd.enableIdxCheck  = true;
                cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

                ret = Cy_SD_Host_SendCommand(base, &cmd);
                
                if (CY_SD_HOST_SUCCESS == ret)
                {
                    /* Wait for the Command Complete event. */
                    ret = Cy_SD_Host_PollCmdComplete(base);
                }
                
                if ((CY_SD_HOST_SUCCESS == ret) &&
                    (false == dataConfig.enableDma))
                {
                    /* DMA is not used - wait until all data is written. */
                    ret = Cy_SD_Host_CmdTxData(base, &dataConfig);
                }
            }
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_Erase
****************************************************************************//**
*
*  Erases the number block data of the SD card / eMMC.
*
* \note This function starts the erase operation end exits.
* It is the user's responsibility to check when the erase operation completes.
* The erase operation completes when ref\ Cy_SD_Host_GetCardStatus returns
* the status value where both ready-for-data (CY_SD_HOST_CMD13_READY_FOR_DATA)
* and card-transition (CY_SD_HOST_CARD_TRAN) bits are set.
* Also it is the user's responsibility to clear the CY_SD_HOST_CMD_COMPLETE flag 
* after calling this function.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param startAddr
*     The address to start erasing from.
*
* \param endAddr
*     The address to stop erasing.
*
* \param eraseType
*     Specifies the erase type (FULE, DISCARD).
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_Erase(SDHC_Type *base,
                                        uint32_t startAddr,
                                        uint32_t endAddr,
                                        cy_en_sd_host_erase_type_t eraseType,
                                        cy_stc_sd_host_context_t const *context)
{
    cy_en_sd_host_status_t      ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    cy_stc_sd_host_cmd_config_t cmd;

    if ((NULL != context) && (NULL != base))
    { 
        /* 0<maxSectorNum check is needed for legacy EMMC cards */
        if (!((0UL < context->maxSectorNum) &&
              ((context->maxSectorNum < (startAddr)) ||
               (context->maxSectorNum < (endAddr)))))
        {
            /* Initialize the command parameters */
            cmd.dataPresent    = false;
            cmd.enableAutoResponseErrorCheck = false;
            cmd.respType       = CY_SD_HOST_RESPONSE_LEN_48;
            cmd.enableCrcCheck = true;
            cmd.enableIdxCheck = true;
            cmd.cmdType        = CY_SD_HOST_CMD_NORMAL;

            /* EraseStartAddr (CMD32) */
            if (CY_SD_HOST_SDSC == context->cardCapacity)
            {
                /* The SDSC card uses a byte-unit address, multiply by 512 */
                startAddr = startAddr << CY_SD_HOST_SDSC_ADDR_SHIFT;
            }

            if (CY_SD_HOST_EMMC == context->cardType)
            {
                cmd.commandIndex = CY_SD_HOST_SD_CMD35;
            }
            else
            {
                cmd.commandIndex = CY_SD_HOST_SD_CMD32;
            }
            cmd.commandArgument = startAddr;

            ret = Cy_SD_Host_SendCommand(base, &cmd);
            
            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Wait for the Command Complete event. */
                ret = Cy_SD_Host_PollCmdComplete(base);
            }

