ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_sd_host.c
            /* EraseEndAddr (CMD33) */
            if (CY_SD_HOST_SDSC == context->cardCapacity)
            {
                /* The SDSC card uses a byte-unit address, multiply by 512 */
                endAddr = endAddr << CY_SD_HOST_SDSC_ADDR_SHIFT;
            }

            if (CY_SD_HOST_EMMC == context->cardType)
            {
                cmd.commandIndex = CY_SD_HOST_SD_CMD36;
            }
            else
            {
                cmd.commandIndex = CY_SD_HOST_SD_CMD33;
            }
            cmd.commandArgument = endAddr;

            ret = Cy_SD_Host_SendCommand(base, &cmd);
            
            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Wait for the Command Complete event. */
                ret = Cy_SD_Host_PollCmdComplete(base);
            }

            /* Erase (CMD38) */
            cmd.commandIndex = CY_SD_HOST_SD_CMD38;

            switch (eraseType)
            {
                case CY_SD_HOST_ERASE_ERASE:
                    cmd.commandArgument = CY_SD_HOST_ERASE;
                    break;
                case CY_SD_HOST_ERASE_DISCARD:
                    if (CY_SD_HOST_EMMC == context->cardType)
                    {
                        cmd.commandArgument = CY_SD_HOST_EMMC_DISCARD;
                    }
                    else
                    {
                        cmd.commandArgument = CY_SD_HOST_SD_DISCARD;
                    }
                    break;
                case CY_SD_HOST_ERASE_FULE:
                    cmd.commandArgument = CY_SD_HOST_SD_FULE;
                    break;
                case CY_SD_HOST_ERASE_SECURE:
                    cmd.commandArgument = CY_SD_HOST_EMMC_SECURE_ERASE;
                    break;
                case CY_SD_HOST_ERASE_SECURE_TRIM_STEP_2:
                    cmd.commandArgument = CY_SD_HOST_EMMC_SECURE_TRIM_STEP_2;
                    break;
                case CY_SD_HOST_ERASE_SECURE_TRIM_STEP_1:
                    cmd.commandArgument = CY_SD_HOST_EMMC_SECURE_TRIM_STEP_1;
                    break;
                case CY_SD_HOST_ERASE_TRIM:
                    cmd.commandArgument = CY_SD_HOST_EMMC_TRIM;
                    break;
                default:
                    ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
                    break;
            }

            ret = Cy_SD_Host_SendCommand(base, &cmd);
        }
    }

    return ret;
}

/* The commands low level section */

/*******************************************************************************
* Function Name: Cy_SD_Host_PollCmdLineFree
****************************************************************************//**
*
*  Waits for the command line free.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollCmdLineFree(SDHC_Type const *base)
{
    cy_en_sd_host_status_t ret   = CY_SD_HOST_ERROR_TIMEOUT;
    uint32_t               retry = CY_SD_HOST_RETRY_TIME;
    bool                   commandInhibit;

    while (retry > 0UL)
    {
        commandInhibit = _FLD2BOOL(SDHC_CORE_PSTATE_REG_CMD_INHIBIT,
                                   SDHC_CORE_PSTATE_REG(base));

        if (false == commandInhibit)
        {
            ret = CY_SD_HOST_SUCCESS;
            break;
        }

        Cy_SysLib_DelayUs(CY_SD_HOST_CMD_TIMEOUT_MS);
        retry--;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_PollDataLineNotInhibit
****************************************************************************//**
*
*  Waits for the data line is not inhibit.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollDataLineNotInhibit(SDHC_Type const *base)
{
    cy_en_sd_host_status_t ret   = CY_SD_HOST_ERROR_TIMEOUT;
    uint32_t               retry = CY_SD_HOST_RETRY_TIME;
    bool                   dataInhibit;

    while (retry > 0UL)
    {
        dataInhibit = _FLD2BOOL(SDHC_CORE_PSTATE_REG_CMD_INHIBIT_DAT,
                                SDHC_CORE_PSTATE_REG(base));

        if (false == dataInhibit)
        {
            ret = CY_SD_HOST_SUCCESS;
            break;
        }

        Cy_SysLib_DelayUs(CY_SD_HOST_CMD_TIMEOUT_MS);
        retry--;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_PollDataLineFree
****************************************************************************//**
*
*  Waits for the data line free.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollDataLineFree(SDHC_Type const *base)
{
    cy_en_sd_host_status_t ret   = CY_SD_HOST_SUCCESS;
    uint32_t               retry = CY_SD_HOST_RETRY_TIME;

    while ((true == _FLD2BOOL(SDHC_CORE_PSTATE_REG_DAT_LINE_ACTIVE, SDHC_CORE_PSTATE_REG(base))) && 
           (retry > 0UL))
    {
        Cy_SysLib_DelayUs(CY_SD_HOST_WRITE_TIMEOUT_MS);
        retry--;
    }

    if (true == _FLD2BOOL(SDHC_CORE_PSTATE_REG_DAT_LINE_ACTIVE, SDHC_CORE_PSTATE_REG(base)))
    {
        ret = CY_SD_HOST_ERROR_TIMEOUT;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_PollBufferReadReady
****************************************************************************//**
*
*  Waits for the Buffer Read ready event.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollBufferReadReady(SDHC_Type *base)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_TIMEOUT;
    uint32_t               retry = CY_SD_HOST_RETRY_TIME;

    while (retry > 0UL)
    {
        /* Check the Buffer Read ready */
        if (true == _FLD2BOOL(SDHC_CORE_NORMAL_INT_STAT_R_BUF_RD_READY,
                             SDHC_CORE_NORMAL_INT_STAT_R(base)))
        {
            /* Clear the interrupt flag */
             SDHC_CORE_NORMAL_INT_STAT_R(base) = CY_SD_HOST_BUF_RD_READY;

            ret = CY_SD_HOST_SUCCESS;
            break;
        }

        Cy_SysLib_DelayUs(CY_SD_HOST_BUFFER_RDY_TIMEOUT_MS);
        retry--;
    }

    return ret;
}


