ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_sd_host.c
/*******************************************************************************
* Function Name: Cy_SD_Host_PollBufferWriteReady
****************************************************************************//**
*
*  Waits for the Buffer Write ready event.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollBufferWriteReady(SDHC_Type *base)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_TIMEOUT;
    uint32_t               retry = CY_SD_HOST_RETRY_TIME;

    while (retry > 0UL)
    {
        /* Check the Buffer Write ready */
        if (true == _FLD2BOOL(SDHC_CORE_NORMAL_INT_STAT_R_BUF_WR_READY,
                              SDHC_CORE_NORMAL_INT_STAT_R(base)))
        {
            /* Clear the interrupt flag */
             SDHC_CORE_NORMAL_INT_STAT_R(base) = CY_SD_HOST_BUF_WR_READY;

            ret = CY_SD_HOST_SUCCESS;
            break;
        }

        Cy_SysLib_DelayUs(CY_SD_HOST_BUFFER_RDY_TIMEOUT_MS);
        retry--;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_PollCmdComplete
****************************************************************************//**
*
*  Waits for the Command Complete event.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollCmdComplete(SDHC_Type *base)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_TIMEOUT;
    uint32_t               retry = CY_SD_HOST_RETRY_TIME;

    while (retry > 0UL)
    {
        /* Command Complete */
        if (true == _FLD2BOOL(SDHC_CORE_NORMAL_INT_STAT_R_CMD_COMPLETE,
                             SDHC_CORE_NORMAL_INT_STAT_R(base)))
        {
            /* Clear the interrupt flag */
             SDHC_CORE_NORMAL_INT_STAT_R(base) = CY_SD_HOST_CMD_COMPLETE;

            ret = CY_SD_HOST_SUCCESS;
            break;
        }

        Cy_SysLib_DelayUs(CY_SD_HOST_CMD_TIMEOUT_MS);
        retry--;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_PollTransferComplete
****************************************************************************//**
*
*  Waits for the Transfer Complete event.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollTransferComplete(SDHC_Type *base)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_TIMEOUT;
    uint32_t               retry = CY_SD_HOST_RETRY_TIME;

    while (retry > 0UL)
    {
        /* Transfer Complete */
        if (true == _FLD2BOOL(SDHC_CORE_NORMAL_INT_STAT_R_XFER_COMPLETE,
                             SDHC_CORE_NORMAL_INT_STAT_R(base)))
        {
            /* Clear the interrupt flag */
            SDHC_CORE_NORMAL_INT_STAT_R(base) = CY_SD_HOST_XFER_COMPLETE;

            ret = CY_SD_HOST_SUCCESS;
            break;
        }

        Cy_SysLib_DelayUs(CY_SD_HOST_WRITE_TIMEOUT_MS);
        retry--;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_CmdRxData
****************************************************************************//**
*
*  Reads the command data using a non-DMA data transfer. 
*  This function is blocking (it exits after all data is read).  
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *pcmd
*     The pointer to the current command data structure.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
static cy_en_sd_host_status_t Cy_SD_Host_CmdRxData(SDHC_Type *base,
                                                   cy_stc_sd_host_data_config_t *pcmd)
{
    cy_en_sd_host_status_t ret;
    uint32_t               blkSize;
    uint32_t               blkCnt;
    uint32_t               i;
    uint32_t               retry;

    blkCnt = pcmd->numberOfBlock;
    blkSize = pcmd->blockSize;

    while (blkCnt > 0UL)
    {
        /* Wait for the Buffer Read ready. */
        ret = Cy_SD_Host_PollBufferReadReady(base);

        if (CY_SD_HOST_SUCCESS != ret)
        {
            break;
        }

        for ( i = blkSize >> 2UL; i != 0UL; i-- )
        {
            /* Wait if valid data exists in the Host buffer. */
            retry = CY_SD_HOST_RETRY_TIME;
            while ((false == _FLD2BOOL(SDHC_CORE_PSTATE_REG_BUF_RD_ENABLE,
                                      SDHC_CORE_PSTATE_REG(base))) &&
                   (retry > 0UL))
            {
                Cy_SysLib_DelayUs(CY_SD_HOST_RD_WR_ENABLE_TIMEOUT); 
                retry--;
            }

            if (false == _FLD2BOOL(SDHC_CORE_PSTATE_REG_BUF_RD_ENABLE,
                                   SDHC_CORE_PSTATE_REG(base)))
            {
                break;
            }

            /* Read data from the Host buffer. */
            *pcmd->data = Cy_SD_Host_BufferRead(base);
            pcmd->data++;
        }
        blkCnt--;
    }

    /* Wait for the Transfer Complete. */
    ret = Cy_SD_Host_PollTransferComplete(base);

    (void)Cy_SD_Host_PollCmdLineFree(base);
    (void)Cy_SD_Host_PollDataLineNotInhibit(base);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_CmdTxData
****************************************************************************//**
*
*  Writes the command data using a non-DMA data transfer. 
*  This function is blocking (it exits after all data is written).
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *pcmd
*     The pointer to the current command data structure.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_CmdTxData(SDHC_Type *base,
                                                   cy_stc_sd_host_data_config_t *pcmd)
{
    cy_en_sd_host_status_t ret;
    uint32_t               blkSize;
    uint32_t               blkCnt;
    uint32_t               i;
    uint32_t               retry;

